import { MapContainer, TileLayer, Marker, Popup } from 'react-leaflet';
import 'leaflet/dist/leaflet.css';

const MapView = () => {
    const center = [42.304, 25.700];
    const maxBoundsC = [
        [41.2, 22.35],
        [44.3, 28.6]
        ]
        const reservoirs = {
          "яз. Кула": [43.90810, 22.51475],
          "яз. Александър Стамболийски": [43.10788, 25.12810],
          "яз. Батак": [41.9669, 24.1802],
          "яз. Беглика": [41.82519, 24.12820],
          "яз. Голям Беглик": [41.80542, 24.11661],
          "яз. Белмекен": [42.16251, 23.79944],
          "яз. Искър": [42.46880, 23.56943],
          "яз. Пасарел(Кокаляне)": [42.55327, 23.47898],
          "яз. Тошков Чарк": [41.81048, 24.16552],
          "яз. Чаира": [42.156500, 23.869835],
          "яз. Широка Поляна": [41.75812, 24.17056],
          "яз. Въча": [41.93364, 24.43623],
          "яз. Доспат": [41.70586, 24.07432],
          "яз. Ивайловград": [41.64919, 25.95785],
          "яз. Копринка(Тунджа)": [42.61577, 25.28288],
          "яз. Кричим": [41.98494, 24.45933],
          "яз. Кърджали": [41.65098, 25.29121],
          "яз. Розов Кладенец": [42.14298, 25.90116],
          "яз. Студен Кладенец": [41.63982, 25.59186],
          "яз. Цанков Камък": [41.82090, 24.43865],
          "яз. Йовковци": [42.93406, 25.77246],
          "яз. Среченска Бара": [43.20652, 23.20445],
          "яз. Хр. Смирненски": [42.80585, 25.25555],
          "яз. Бели Искър": [42.12848, 23.56730],
          "яз. Дяково": [42.35277, 23.08741],
          "яз. Студена": [42.52981, 23.15050],
          "яз. Асеновец": [42.72701, 26.25039],
          "яз. Боровица": [41.76368, 25.13260],
          "яз. Камчия": [42.87018, 26.90766],
          "яз. Тича": [43.05591, 26.76689],
          "яз. Ясна поляна": [42.24523, 27.58374],
          "яз. Бели лом": [43.40424, 26.66613],
          "яз. Съединение": [43.33055, 26.58111],
          "яз. Горен Дъбник": [43.36999, 24.31666],
          "яз. Огоста": [43.37823, 23.18432],
          "яз. Рабиша": [43.73802, 22.58519],
          "яз. Сопот": [43.00013, 24.44465],
          "яз. Ястребино": [43.15100, 26.27767],
          "яз. Панчарево": [42.59462, 23.41755],
          "яз. Пчелина": [42.52095, 22.84808],
          "яз. Тополница": [42.44028, 24.00216],
          "яз. Домлян": [42.54880, 24.91958],
          "яз. Жребчево": [42.61564, 25.85958],
          "яз. Малко Шарково": [42.11401, 26.86723],
          "яз. Пясъчник": [42.40635, 24.57117],
          "яз. Тракиец": [41.85173, 25.40775],
          "яз. Цонево": [42.99460, 27.40434],
          "яз. Калин": [42.17384, 23.24981],
          "яз. Карагьол": [42.185508, 23.254954],
          "яз. Огняново": [42.61249, 23.75096],
          "яз. Ахелой": [42.70715, 27.51850],
          "яз. Порой": [42.72419, 27.60810]
        };




  return (
    <MapContainer 
      center={center} 
      zoom={7}
      maxZoom={17}
      minZoom={8}
      maxBounds={maxBoundsC}
      scrollWheelZoom={true} 
      style={{ height: "100vh", width: "100%" }}
    >
      <TileLayer
        attribution='&copy; <a href="https://www.openstreetmap.org/copyright">OpenStreetMap</a> contributors'
        url="https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png"
      />
      {Object.entries(reservoirs).map(([name, position]) => (
        <Marker key={name} position={position}>
          <Popup>
            {name}
          </Popup>
        </Marker>
      ))}
      
    </MapContainer>
  );
};

export default MapView;
