export const center = [42.304, 25.700];
export const maxBoundsC = [
        [41.2, 22.35],
        [44.3, 28.6]
        ]
export const reservoirs = [
  {
    "Име": "Александър Стамболийски",
    "Област": "Велико Търново",
    "Община местоположение": "Сухиндол",
    "Басейнов район": "Дунавски район"
  },
  {
    "Име": "Батак",
    "Област": "Пазарджик",
    "Община местоположение": "Батак",
    "Басейнов район": "Дунавски район"
  },
  {
    "Име": "Беглика",
    "Област": "Пазарджик",
    "Община местоположение": "Батак",
    "Басейнов район": "Дунавски район"
  },
  {
    "Име": "Белмекен",
    "Област": "Пазарджик",
    "Община местоположение": "Белово",
    "Басейнов район": "Дунавски район"
  },
  {
    "Име": "Голям Беглик",
    "Област": "Пазарджик",
    "Община местоположение": "Батак",
    "Басейнов район": "Дунавски район"
  },
  {
    "Име": "Кокаляне",
    "Област": "София",
    "Община местоположение": "Столична",
    "Басейнов район": "Дунавски район"
  },
  {
    "Име": "Тошков Чарк",
    "Област": "Пазарджик",
    "Община местоположение": "Батак",
    "Басейнов район": "Дунавски район"
  },
  {
    "Име": "Чаира",
    "Област": "Пазарджик",
    "Община местоположение": "Белово",
    "Басейнов район": "Дунавски район"
  },
  {
    "Име": "Широка поляна",
    "Област": "Пазарджик",
    "Община местоположение": "Батак",
    "Басейнов район": "Дунавски район"
  },
  {
    "Име": "Въча",
    "Област": "Пловдив",
    "Община местоположение": "Кричим",
    "Басейнов район": "Дунавски район"
  },
  {
    "Име": "Доспат",
    "Област": "Смолян",
    "Община местоположение": "Доспат",
    "Басейнов район": "Дунавски район"
  },
  {
    "Име": "Ивайловград",
    "Област": "Хасково",
    "Община местоположение": "Ивайловград",
    "Басейнов район": "Дунавски район"
  },
  {
    "Име": "Копринка",
    "Област": "Стара Загора",
    "Община местоположение": "Казанлък",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Кричим",
    "Област": "Пловдив",
    "Община местоположение": "Кричим",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Кърджали",
    "Област": "Кърджали",
    "Община местоположение": "Кърджали",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Розов кладенец",
    "Област": "Стара Загора",
    "Община местоположение": "Гълъбово",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Студен кладенец",
    "Област": "Кърджали",
    "Община местоположение": "Крумовград",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Цанков камък",
    "Област": "Смолян",
    "Община местоположение": "Девин",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Йовковци",
    "Област": "Велико Търново",
    "Община местоположение": "Елена",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Среченска бара",
    "Област": "Монтана",
    "Община местоположение": "Берковица",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Христо Смирненски",
    "Област": "Габрово",
    "Община местоположение": "Габрово",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Бели Искър(Гигант язовир Сталин)",
    "Област": "София",
    "Община местоположение": "Самоков",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Дяково",
    "Област": "Кюстендил",
    "Община местоположение": "Дупница",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Искър",
    "Област": "София",
    "Община местоположение": "Столична",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Студена",
    "Област": "Перник",
    "Община местоположение": "Студена",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Асеновец",
    "Област": "Сливен",
    "Община местоположение": "Сливен",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Боровица",
    "Област": "Кърджали",
    "Община местоположение": "Черноочене",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Камчия",
    "Област": "Бургас",
    "Община местоположение": "Сунгурларе",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Тича",
    "Област": "Шумен",
    "Община местоположение": "Върбица",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Ясна поляна",
    "Област": "Бургас",
    "Община местоположение": "Приморско",
    "Басейнов район": "Западнобеломорски район"
  },
  {
    "Име": "Бели Лом",
    "Област": "Разград",
    "Община местоположение": "Разград",
    "Басейнов район": "Източнобеломорски район"
  },
  {
    "Име": "Горни Дъбник",
    "Област": "Плевен",
    "Община местоположение": "Горни Дъбник",
    "Басейнов район": "Източнобеломорски район"
  },
  {
    "Име": "Кула",
    "Област": "Видин",
    "Община местоположение": "Кула",
    "Басейнов район": "Източнобеломорски район"
  },
  {
    "Име": "Огоста",
    "Област": "Монтана",
    "Община местоположение": "Монтана",
    "Басейнов район": "Източнобеломорски район"
  },
  {
    "Име": "Рабиша",
    "Област": "Видин",
    "Община местоположение": "Макреш",
    "Басейнов район": "Източнобеломорски район"
  },
  {
    "Име": "Сопот",
    "Област": "Ловеч",
    "Община местоположение": "Угърчин",
    "Басейнов район": "Източнобеломорски район"
  },
  {
    "Име": "Съединение",
    "Област": "Търговище",
    "Община местоположение": "Търговище",
    "Басейнов район": "Източнобеломорски район"
  },
  {
    "Име": "Ястребино",
    "Област": "Търговище",
    "Община местоположение": "Антоново",
    "Басейнов район": "Източнобеломорски район"
  },
  {
    "Име": "Панчарево",
    "Област": "София",
    "Община местоположение": "Столична",
    "Басейнов район": "Източнобеломорски район"
  },
  {
    "Име": "Пчелина",
    "Област": "Перник",
    "Община местоположение": "Ковачевци",
    "Басейнов район": "Източнобеломорски район"
  },
  {
    "Име": "Тополница",
    "Област": "София",
    "Община местоположение": "Ихтиман",
    "Басейнов район": "Източнобеломорски район"
  },
  {
    "Име": "Домлян",
    "Област": "Пловдив",
    "Община местоположение": "Карлово",
    "Басейнов район": "Източнобеломорски район"
  },
  {
    "Име": "Жребчево",
    "Област": "Сливен",
    "Община местоположение": "Нова Загора",
    "Басейнов район": "Източнобеломорски район"
  },
  {
    "Име": "Малко Шарково",
    "Област": "Ямбол",
    "Община местоположение": "Болярово",
    "Басейнов район": "Източнобеломорски район"
  },
  {
    "Име": "Пясъчник",
    "Област": "Пловдив",
    "Община местоположение": "Съединение",
    "Басейнов район": "Източнобеломорски район"
  },
  {
    "Име": "Тракиец",
    "Област": "Хасково",
    "Община местоположение": "Хасково",
    "Басейнов район": "Източнобеломорски район"
  },
  {
    "Име": "Цонево",
    "Област": "Варна",
    "Община местоположение": "Дългопол",
    "Басейнов район": "Черноморски район"
  },
  {
    "Име": "Калин",
    "Област": "Кюстендил",
    "Община местоположение": "Рила",
    "Басейнов район": "Черноморски район"
  },
  {
    "Име": "Карагьол",
    "Област": "Кюстендил",
    "Община местоположение": "Дупница",
    "Басейнов район": "Черноморски район"
  },
  {
    "Име": "Огняново",
    "Област": "София",
    "Община местоположение": "Елин Пелин",
    "Басейнов район": "Черноморски район"
  },
  {
    "Име": "Ахелой",
    "Област": "Бургас",
    "Община местоположение": "Бата",
    "Басейнов район": "Черноморски район"
  },
  {
    "Име": "Порой",
    "Област": "Бургас",
    "Община местоположение": "Несебър",
    "Басейнов район": "Черноморски район"
  }
]

export const redIcon = new L.Icon({
  iconUrl: 'https://cdn.rawgit.com/pointhi/leaflet-color-markers/master/img/marker-icon-2x-red.png',
  shadowUrl: 'https://cdnjs.cloudflare.com/ajax/libs/leaflet/1.7.1/images/marker-shadow.png',
  iconSize: [25, 41],
  iconAnchor: [12, 41],
  popupAnchor: [1, -34],
  shadowSize: [41, 41]
});

