export const center = [42.304, 25.700];
export const maxBoundsC = [
        [41.2, 22.35],
        [44.3, 28.6]
        ]
export const reservoirs = [
  {
    "Име": "яз. Александър Стамболийски",
    "Област": "Велико Търново",
    "Община местоположение": "Сухиндол",
    "Басейнов район": "Дунавски район",
    "position": [43.10788, 25.12810]
  },
  {
    "Име": "яз. Батак",
    "Област": "Пазарджик",
    "Община местоположение": "Батак",
    "Басейнов район": "Дунавски район",
    "position": [41.9669, 24.1802]
  },
  {
    "Име": "яз. Беглика",
    "Област": "Пазарджик",
    "Община местоположение": "Батак",
    "Басейнов район": "Дунавски район",
    "position": [41.82519, 24.12820]
  },
  {
    "Име": "яз. Белмекен",
    "Област": "Пазарджик",
    "Община местоположение": "Белово",
    "Басейнов район": "Дунавски район",
    "position": [42.16251, 23.79944]
  },
  {
    "Име": "яз. Голям Беглик",
    "Област": "Пазарджик",
    "Община местоположение": "Батак",
    "Басейнов район": "Дунавски район",
    "position": [41.80542, 24.11661]
  },
  {
    "Име": "яз. Кокаляне",
    "Област": "София",
    "Община местоположение": "Столична",
    "Басейнов район": "Дунавски район",
    "position": [42.55327, 23.47898]
  },
  {
    "Име": "яз. Тошков Чарк",
    "Област": "Пазарджик",
    "Община местоположение": "Батак",
    "Басейнов район": "Дунавски район",
    "position": [41.81048, 24.16552]
  },
  {
    "Име": "яз. Чаира",
    "Област": "Пазарджик",
    "Община местоположение": "Белово",
    "Басейнов район": "Дунавски район",
    "position": [42.15650, 23.86984]
  },
  {
    "Име": "яз. Широка поляна",
    "Област": "Пазарджик",
    "Община местоположение": "Батак",
    "Басейнов район": "Дунавски район",
    "position": [41.75812, 24.17056]
  },
  {
    "Име": "яз. Въча",
    "Област": "Пловдив",
    "Община местоположение": "Кричим",
    "Басейнов район": "Дунавски район",
    "position": [41.93364, 24.43623]
  },
  {
    "Име": "яз. Доспат",
    "Област": "Смолян",
    "Община местоположение": "Доспат",
    "Басейнов район": "Дунавски район",
    "position": [41.70586, 24.07432]
  },
  {
    "Име": "яз. Ивайловград",
    "Област": "Хасково",
    "Община местоположение": "Ивайловград",
    "Басейнов район": "Дунавски район",
    "position": [41.64919, 25.95785]
  },
  {
    "Име": "яз. Копринка",
    "Област": "Стара Загора",
    "Община местоположение": "Казанлък",
    "Басейнов район": "Западнобеломорски район",
    "position": [42.61577, 25.28288]
  },
  {
    "Име": "яз. Кричим",
    "Област": "Пловдив",
    "Община местоположение": "Кричим",
    "Басейнов район": "Западнобеломорски район",
    "position": [41.98494, 24.45933]
  },
  {
    "Име": "яз. Кърджали",
    "Област": "Кърджали",
    "Община местоположение": "Кърджали",
    "Басейнов район": "Западнобеломорски район",
    "position": [41.65098, 25.29121]
  },
  {
    "Име": "яз. Розов кладенец",
    "Област": "Стара Загора",
    "Община местоположение": "Гълъбово",
    "Басейнов район": "Западнобеломорски район",
    "position": [42.14298, 25.90116]
  },
  {
    "Име": "яз. Студен кладенец",
    "Област": "Кърджали",
    "Община местоположение": "Крумовград",
    "Басейнов район": "Западнобеломорски район",
    "position": [41.63982, 25.59186]
  },
  {
    "Име": "яз. Цанков камък",
    "Област": "Смолян",
    "Община местоположение": "Девин",
    "Басейнов район": "Западнобеломорски район",
    "position": [41.82090, 24.43865]
  },
  {
    "Име": "яз. Йовковци",
    "Област": "Велико Търново",
    "Община местоположение": "Елена",
    "Басейнов район": "Западнобеломорски район",
    "position": [42.93406, 25.77246]
  },
  {
    "Име": "яз. Среченска бара",
    "Област": "Монтана",
    "Община местоположение": "Берковица",
    "Басейнов район": "Западнобеломорски район",
    "position": [43.20652, 23.20445]
  },
  {
    "Име": "яз. Христо Смирненски",
    "Област": "Габрово",
    "Община местоположение": "Габрово",
    "Басейнов район": "Западнобеломорски район",
    "position": [42.80585, 25.25555]
  },
  {
    "Име": "яз. Бели Искър",
    "Област": "София",
    "Община местоположение": "Самоков",
    "Басейнов район": "Западнобеломорски район",
    "position": [42.12848, 23.56730]
  },
  {
    "Име": "яз. Дяково",
    "Област": "Кюстендил",
    "Община местоположение": "Дупница",
    "Басейнов район": "Западнобеломорски район",
    "position": [42.35277, 23.08741]
  },
  {
    "Име": "яз. Искър",
    "Област": "София",
    "Община местоположение": "Столична",
    "Басейнов район": "Западнобеломорски район",
    "position": [42.46880, 23.56943]
  },
  {
    "Име": "яз. Студена",
    "Област": "Перник",
    "Община местоположение": "Студена",
    "Басейнов район": "Западнобеломорски район",
    "position": [42.52981, 23.15050]
  },
  {
    "Име": "яз. Асеновец",
    "Област": "Сливен",
    "Община местоположение": "Сливен",
    "Басейнов район": "Западнобеломорски район",
    "position": [42.72701, 26.25039]
  },
  {
    "Име": "яз. Боровица",
    "Област": "Кърджали",
    "Община местоположение": "Черноочене",
    "Басейнов район": "Западнобеломорски район",
    "position": [41.76368, 25.13260]
  },
  {
    "Име": "яз. Камчия",
    "Област": "Бургас",
    "Община местоположение": "Сунгурларе",
    "Басейнов район": "Западнобеломорски район",
    "position": [42.87018, 26.90766]
  },
  {
    "Име": "яз. Тича",
    "Област": "Шумен",
    "Община местоположение": "Върбица",
    "Басейнов район": "Западнобеломорски район",
    "position": [43.05591, 26.76689]
  },
  {
    "Име": "яз. Ясна поляна",
    "Област": "Бургас",
    "Община местоположение": "Приморско",
    "Басейнов район": "Западнобеломорски район",
    "position": [42.24523, 27.58374]
  },
  {
    "Име": "яз. Бели лом",
    "Област": "Разград",
    "Община местоположение": "Разград",
    "Басейнов район": "Източнобеломорски район",
    "position": [43.40424, 26.66613]
  },
  {
    "Име": "яз. Горни Дъбник",
    "Област": "Плевен",
    "Община местоположение": "Горни Дъбник",
    "Басейнов район": "Източнобеломорски район",
    "position": [43.36999, 24.31666]
  },
  {
    "Име": "Кула",
    "Област": "Видин",
    "Община местоположение": "Кула",
    "Басейнов район": "Източнобеломорски район",
    "position": [43.90810, 22.51475]
  },
  {
    "Име": "яз. Огоста",
    "Област": "Монтана",
    "Община местоположение": "Монтана",
    "Басейнов район": "Източнобеломорски район",
    "position": [43.37823, 23.18432]
  },
  {
    "Име": "яз. Рабиша",
    "Област": "Видин",
    "Община местоположение": "Макреш",
    "Басейнов район": "Източнобеломорски район",
    "position": [43.73802, 22.58519]
  },
  {
    "Име": "яз. Сопот",
    "Област": "Ловеч",
    "Община местоположение": "Угърчин",
    "Басейнов район": "Източнобеломорски район",
    "position": [43.00013, 24.44465]
  },
  {
    "Име": "яз. Съединение",
    "Област": "Търговище",
    "Община местоположение": "Търговище",
    "Басейнов район": "Източнобеломорски район",
    "position": [43.33055, 26.58111]
  },
  {
    "Име": "яз. Ястребино",
    "Област": "Търговище",
    "Община местоположение": "Антоново",
    "Басейнов район": "Източнобеломорски район",
    "position": [43.15100, 26.27767]
  },
  {
    "Име": "яз. Панчарево",
    "Област": "София",
    "Община местоположение": "Столична",
    "Басейнов район": "Източнобеломорски район",
    "position": [42.59462, 23.41755]
  },
  {
    "Име": "яз. Пчелина",
    "Област": "Перник",
    "Община местоположение": "Ковачевци",
    "Басейнов район": "Източнобеломорски район",
    "position": [42.52095, 22.84808]
  },
  {
    "Име": "яз. Тополница",
    "Област": "София",
    "Община местоположение": "Ихтиман",
    "Басейнов район": "Източнобеломорски район",
    "position": [42.44028, 24.00216]
  },
  {
    "Име": "яз. Домлян",
    "Област": "Пловдив",
    "Община местоположение": "Карлово",
    "Басейнов район": "Източнобеломорски район",
    "position": [42.54880, 24.91958]
  },
  {
    "Име": "яз. Жребчево",
    "Област": "Сливен",
    "Община местоположение": "Нова Загора",
    "Басейнов район": "Източнобеломорски район",
    "position": [42.61564, 25.85958]
  },
  {
    "Име": "яз. Малко Шарково",
    "Област": "Ямбол",
    "Община местоположение": "Болярово",
    "Басейнов район": "Източнобеломорски район",
    "position": [42.11401, 26.86723]
  },
  {
    "Име": "яз. Пясъчник",
    "Област": "Пловдив",
    "Община местоположение": "Съединение",
    "Басейнов район": "Източнобеломорски район",
    "position": [42.40635, 24.57117]
  },
  {
    "Име": "яз. Тракиец",
    "Област": "Хасково",
    "Община местоположение": "Хасково",
    "Басейнов район": "Източнобеломорски район",
    "position": [41.85173, 25.40775]
  },
  {
    "Име": "яз. Цонево",
    "Област": "Варна",
    "Община местоположение": "Дългопол",
    "Басейнов район": "Черноморски район",
    "position": [42.99460, 27.40434]
  },
  {
    "Име": "яз. Калин",
    "Област": "Кюстендил",
    "Община местоположение": "Рила",
    "Басейнов район": "Черноморски район",
    "position": [42.17384, 23.24981]
  },
  {
    "Име": "яз. Карагьол",
    "Област": "Кюстендил",
    "Община местоположение": "Дупница",
    "Басейнов район": "Черноморски район",
    "position": [42.18551, 23.25495]
  },
  {
    "Име": "яз. Огняново",
    "Област": "София",
    "Община местоположение": "Елин Пелин",
    "Басейнов район": "Черноморски район",
    "position": [42.61249, 23.75096]
  },
  {
    "Име": "яз. Ахелой",
    "Област": "Бургас",
    "Община местоположение": "Бата",
    "Басейнов район": "Черноморски район",
    "position": [42.70715, 27.51850]
  },
  {
    "Име": "яз. Порой",
    "Област": "Бургас",
    "Община местоположение": "Несебър",
    "Басейнов район": "Черноморски район",
    "position": [42.72419, 27.60810]
  }
];


export const redIcon = new L.Icon({
  iconUrl: 'https://cdn.rawgit.com/pointhi/leaflet-color-markers/master/img/marker-icon-2x-red.png',
  shadowUrl: 'https://cdnjs.cloudflare.com/ajax/libs/leaflet/1.7.1/images/marker-shadow.png',
  iconSize: [25, 41],
  iconAnchor: [12, 41],
  popupAnchor: [1, -34],
  shadowSize: [41, 41]
});

